This material should help you get the ideas clearer from the first meeting:

In [2]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

# now in a dict:
data={'name':names, 'age':ages, 'girl':woman,'born In':country, 'degree':education}

#now into a DF
import pandas as pd

friends=pd.DataFrame.from_dict(data)
# seeing it:
friends

      name  age   girl  born In  degree
0    Tomás   32  False    Chile    Bach
1  Pauline   33   True  Senegal    Bach
2    Pablo   28  False    Spain  Master
3    Bjork   30  False   Norway     PhD
4     Alan   32  False     Peru    Bach
5    Juana   27   True     Peru  Master

The result is what you expected, but you need to be sure of what data structure you have:

In [12]:
#what is it?
type(friends)

pandas.core.frame.DataFrame

In [13]:
#this is good
friends.age

0    32
1    33
2    28
3    30
4    32
5    27
Name: age, dtype: int64

In [14]:
#what is it?
type(friends.age)

pandas.core.series.Series

In [15]:
#this is good
friends['age']

0    32
1    33
2    28
3    30
4    32
5    27
Name: age, dtype: int64

In [16]:
#what is it?
type(friends['age'])

pandas.core.series.Series

In [ ]:
#this is bad
friends.iloc[['age']]

In [ ]:
#this is bad
friends.loc[['age']]

In [ ]:
#this is bad
friends['age','born In']

In [17]:
#this is good
friends[['age','born In']]

   age  born In
0   32    Chile
1   33  Senegal
2   28    Spain
3   30   Norway
4   32     Peru
5   27     Peru

In [18]:
# what is it?
type(friends[['age','born In']]) # we can put a list inside the brackets

pandas.core.frame.DataFrame

In [ ]:
#this is bad
friends.'born In'

In [19]:
#this is good
friends.loc[:,['age','born In']] # using loc tells python which rows/columns we want
# : tells us we want all rows
# age & born In says we want just these columns

   age  born In
0   32    Chile
1   33  Senegal
2   28    Spain
3   30   Norway
4   32     Peru
5   27     Peru

In [20]:
type(friends.loc[:,['age','born In']])

pandas.core.frame.DataFrame

In [ ]:
#this is bad
friends.loc[:,['age':'born In']] # cannot slice dataframe in loc

In [ ]:
#this is bad
friends.iloc[:,['age','born In']] # iloc vs loc ---- iloc uses list of positions, loc uses list of names

In [23]:
# this is good (but different)
friends.iloc[:,1:4] 
# all rows, position 1 to before position 4
# accepts a list of indexes but not a list of names

   age   girl  born In
0   32  False    Chile
1   33   True  Senegal
2   28  False    Spain
3   30  False   Norway
4   32  False     Peru
5   27   True     Peru

In [24]:
# what is it?
type(friends.iloc[:,1:4])

pandas.core.frame.DataFrame

In [25]:
# this is good
friends.iloc[:,[1,3]]
# : give all rows
# give position 1 and position 3 in columns (so column 2 and column 4)

   age  born In
0   32    Chile
1   33  Senegal
2   28    Spain
3   30   Norway
4   32     Peru
5   27     Peru

In [26]:
#what is it?
type(friends.iloc[:,[1,3]])

pandas.core.frame.DataFrame

Most of our operations are done on Data frames, because they have several columns and we used that for the subsetting:

In [27]:
friends[friends.age>30] # only shows friends given they are older than 30

      name  age   girl  born In degree
0    Tomás   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

Some people like coding with the filter language:

In [30]:
filter1=friends.age>30 # gives the operation the name "filter1", uses the name of dataframe
friends[filter1]

      name  age   girl  born In degree
0    Tomás   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

In [31]:
friends.where(filter1)
# creates missing values for friends who don't meet the condition

      name   age  girl  born In degree
0    Tomás  32.0   0.0    Chile   Bach
1  Pauline  33.0   1.0  Senegal   Bach
2      NaN   NaN   NaN      NaN    NaN
3      NaN   NaN   NaN      NaN    NaN
4     Alan  32.0   0.0     Peru   Bach
5      NaN   NaN   NaN      NaN    NaN

In [32]:
filter1a='age>30'
friends.query(filter1a)
# unlike where(), query() uses text and does not use the name of the dataframe

      name  age   girl  born In degree
0    Tomás   32  False    Chile   Bach
1  Pauline   33   True  Senegal   Bach
4     Alan   32  False     Peru   Bach

In [33]:
isinstance(friends[filter1], pd.DataFrame), \
isinstance(friends.where(filter1), pd.DataFrame), \
isinstance(friends.query(filter1a), pd.DataFrame)

(True, True, True)

When you have Boolean values (True/False) you can simplify:

In [34]:
#from:
friends[friends.girl==False]
# we don't need to write True/False in quotations since they are Boolean values

    name  age   girl born In  degree
0  Tomás   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

In [35]:
# to...
friends[~friends.girl] # still asks for friends who are not girls

    name  age   girl born In  degree
0  Tomás   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

You can have two filters:

In [ ]:
# this will not work
friends[~friends.girl & friends.degree=='Bach']

In [37]:
# this will (with parentheses)
friends[(~friends.girl) & (friends.degree=='Bach')] # & needs parentheses

    name  age   girl born In degree
0  Tomás   32  False   Chile   Bach
4   Alan   32  False    Peru   Bach

Other times you want a values once a filter was applied:

In [39]:
# youngest male:
friends[(~friends.girl) & (friends.age.min())] # this is wrong, just gives us all the men

    name  age   girl born In  degree
0  Tomás   32  False   Chile    Bach
2  Pablo   28  False   Spain  Master
3  Bjork   30  False  Norway     PhD
4   Alan   32  False    Peru    Bach

In [40]:
friends[(~friends.girl) & (friends.age==friends.age.min())] # this is wrong too!
# we don't get an answer because we are asking for a man who happens to be 27 (the min age)...there is none
# using "and" --> only true if all conditions are true

Empty DataFrame
Columns: [name, age, girl, born In, degree]
Index: []

In [38]:
friends.age.min() # the youngest age overall

27

You got empty answer because there is no man aged 27.

In [41]:
# this is correct
friends[~friends.girl].age.min() # the age of the youngest man
# the "." says once you filter out the men, give me the youngest age

28

Once you know the right age, you have to put it in the right place:

In [3]:
friends[friends.age==friends[~friends.girl].age.min()] # gives entire row for youngest man

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [4]:
# or
friends.where(friends.age==friends[~friends.girl].age.min())
# makes everyone who is not the youngest man a missing value

    name   age  girl born In  degree
0    NaN   NaN   NaN     NaN     NaN
1    NaN   NaN   NaN     NaN     NaN
2  Pablo  28.0   0.0   Spain  Master
3    NaN   NaN   NaN     NaN     NaN
4    NaN   NaN   NaN     NaN     NaN
5    NaN   NaN   NaN     NaN     NaN

In [5]:
# or
friends.where(friends.age==friends[~friends.girl].age.min()).dropna()
# makes everyone who is not the youngest man a missing value, and then drops them

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master

The problem is that 'friends' are not subset and the age keeps being that of the youngest woman:

In [6]:
# bad:
friends.where(~friends.girl).where(friends.age==friends.age.min())

  name  age  girl born In degree
0  NaN  NaN   NaN     NaN    NaN
1  NaN  NaN   NaN     NaN    NaN
2  NaN  NaN   NaN     NaN    NaN
3  NaN  NaN   NaN     NaN    NaN
4  NaN  NaN   NaN     NaN    NaN
5  NaN  NaN   NaN     NaN    NaN

That's the advantage of **query**:

In [7]:
friends.query('~girl').query('age==age.min()')
# takes the name of the column without having to specify the dataframe

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [8]:
#but

students=friends.copy()

students.where(~students.girl,inplace=True) #real subset, inplace alters the dataset with the subset/our operation
students.where(students.age==students.age.min())

    name   age  girl born In  degree
0    NaN   NaN   NaN     NaN     NaN
1    NaN   NaN   NaN     NaN     NaN
2  Pablo  28.0   0.0   Spain  Master
3    NaN   NaN   NaN     NaN     NaN
4    NaN   NaN   NaN     NaN     NaN
5    NaN   NaN   NaN     NaN     NaN

Let's vary the data a little:

In [9]:
names=["Tomás", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,28,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

# now in a dict:
data={'name':names, 'age':ages, 'girl':woman,'born In':country, 'degree':education}

#now into a DF
import pandas as pd

friends2=pd.DataFrame.from_dict(data)
# seeing it:
friends2

      name  age   girl  born In  degree
0    Tomás   32  False    Chile    Bach
1  Pauline   28   True  Senegal    Bach
2    Pablo   28  False    Spain  Master
3    Bjork   30  False   Norway     PhD
4     Alan   32  False     Peru    Bach
5    Juana   27   True     Peru  Master

There is a girl with the same age as the youngest boy, then:

In [10]:
friends2.where(friends2.age==friends2[~friends2.girl].age.min()).dropna()
# keep the rows where the person is the same age as the youngest man
# this gives us both Pauline and Pablo since they are both 28

      name   age  girl  born In  degree
1  Pauline  28.0   1.0  Senegal    Bach
2    Pablo  28.0   0.0    Spain  Master

We need a previous strategy:

In [ ]:
# bad implementation:
friends2.where(friends2.age==friends2[~friends2.girl].age.min() & friends2.girl==False).dropna()

In [ ]:
# bad implementation:
friends2.where(friends2.age==friends2[~friends2.girl].age.min() & ~friends2.girl).dropna()

In [12]:
# just parentheses to make it work!
friends2.where((friends2.age==friends2[~friends2.girl].age.min()) & (~friends2.girl)).dropna()
# keep the rows where the person is the same age as the youngest man
# and then only keep the person who identifies as male (so we drop Pauline)
### we need the & to specify we only want Pablo

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master

This one still works!

In [13]:
friends2.query('~girl').query('age==age.min()')

    name  age   girl born In  degree
2  Pablo   28  False   Spain  Master

In [14]:
students2=friends2.copy()

students2.where(~students2.girl,inplace=True) #real subset
students2.where(students2.age==students2.age.min()).dropna()

    name   age  girl born In  degree
2  Pablo  28.0   0.0   Spain  Master